Revit 2024 API
AddInCommandBinding Class
 This object represents a binding between a Revit command and one or more handlers which override the behavior of the command in Revit.
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public class AddInCommandBinding
Visual Basic
Public Class AddInCommandBinding
Visual C++
public ref class AddInCommandBinding
Inheritance Hierarchy
System.Object
 Autodesk.Revit.UI.AddInCommandBinding
See Also
AddInCommandBinding Members
Autodesk.Revit.UI Namespace